Revit 2024 API
KeyBasedTreeEntriesLoadContent Members
The KeyBasedTreeEntriesLoadContent type exposes the following members.
Methods
Name | Description
AddEntry
 Adds one KeyBasedTreeEntry to this KeyBasedTreeEntriesLoadContent, which is used to build a KeyBasedTreeEntries object by BuildEntries function.
BuildEntries
 Builds a KeyBasedTreeEntries object.
CanAddEntry
 Verifies if the KeyBasedTreeEntry could be added in this KeyBasedTreeEntriesLoadContent.
Dispose |  (Inherited from ExternalResourceLoadContent.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetEntries
 Gets a copy of KeyBasedTreeEntries object owned by this KeyBasedTreeEntriesLoadContent object.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetLoadResults
 Returns a copy of the KeyBasedTreeEntriesLoadResults owned by this KeyBasedTreeEntriesLoadContent object.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsEntriesBuilt
 Verifies that the KeyBasedTreeEntries object owned by a KeyBasedTreeEntriesLoadContent object is built.
Reset
 Clears KeyBasedTreeEntriesLoadContent object, including KeyBasedTreeEntries and KeyBasedTreeEntriesLoadResults, owned by this KeyBasedTreeEntriesLoadContent object.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from ExternalResourceLoadContent.)
LoadStatus
 A value to indicate the status of an external resource load operation. IExternalResourceServers should set this in the LoadResource() method.
 (Inherited from ExternalResourceLoadContent.)
Version
 The version of the external data that the server is providing in this object.
 (Inherited from ExternalResourceLoadContent.)
See Also
KeyBasedTreeEntriesLoadContent Class
Autodesk.Revit.DB Namespace